In [1]:
%load_ext sql

# GROUP BY
- GROUP BY clause in SQL is used to group records with identical data and can be used in conjunction with some aggregation functions to produce summarized results from the database.
- The "GROUP BY" clause in SQL is used to group together records that have the same data in a specific column. It's like putting similar items in a box. You can also do calculations on those groups, like finding the total or average, to get summarized information from the database. It's a way to organize and analyze data more efficiently.

## Single Table group by

In [2]:
%%sql mysql://root:redhat@localhost:3306/mydb

#Single table group by

Select Category,count(Price)
from product group by Category;

6 rows affected.

[('Electronics', 4),
 ('Kitchen Appliances', 4),
 ('Clothing', 3),
 ('Accessories', 1),
 ('Furniture', 1),
 ('Footwear', 1)]

In [3]:
%%sql mysql://root:redhat@localhost:3306/mydb

#Single table group by

Select Category,max(Price)
from product group by Category;

6 rows affected.

[('Electronics', 500),
 ('Kitchen Appliances', 75),
 ('Clothing', 60),
 ('Accessories', 45),
 ('Furniture', 150),
 ('Footwear', 70)]

In [4]:
%%sql mysql://root:redhat@localhost:3306/mydb

#Single table group by

Select Category,min(Price)
from product group by Category;

6 rows affected.

[('Electronics', 30),
 ('Kitchen Appliances', 25),
 ('Clothing', 15),
 ('Accessories', 45),
 ('Furniture', 150),
 ('Footwear', 70)]

In [5]:
%%sql mysql://root:redhat@localhost:3306/mydb

#Single table group by

Select Category,avg(Price)
from product group by Category;

6 rows affected.

[('Electronics', Decimal('332.5000')),
 ('Kitchen Appliances', Decimal('47.5000')),
 ('Clothing', Decimal('38.3333')),
 ('Accessories', Decimal('45.0000')),
 ('Furniture', Decimal('150.0000')),
 ('Footwear', Decimal('70.0000'))]

## Two table group by

In [6]:
%%sql mysql://root:redhat@localhost:3306/mydb
Select * from pro;

6 rows affected.

[(101, 'Laptop', 999, 'In Stock'),
 (102, 'Smartphone', 499, 'Out of Stock'),
 (103, 'Headphones', 79, 'In Stock'),
 (104, 'Tablet', 349, 'In Stock'),
 (105, 'Desktop Computer', 1199, 'In Stock'),
 (106, 'Wireless Mouse', 29, 'In Stock')]

In [7]:
%%sql mysql://root:redhat@localhost:3306/mydb
Select * from cus;

8 rows affected.

[(1, 'Rajesh Sharma', 32, 'Mumbai, India', 103),
 (2, 'Sneha Kapoor', 28, 'Delhi, India', 102),
 (3, 'Amit Singh', 35, 'Bangalore, India', 104),
 (4, 'Priya Patel', None, 'Kolkata, India', 101),
 (5, 'Neha Verma', 29, 'Chennai, India', 105),
 (6, None, 38, 'Hyderabad, India', 101),
 (7, 'Pooja Reddy', 24, 'Pune, India', None),
 (8, 'Arun Kumar', 31, 'Jaipur, India', None)]

In [8]:
%%sql mysql://root:redhat@localhost:3306/mydb
select purchase_id,count(productName) as purchase_number from cus
left join pro on pro.pro_id =cus.purchase_id group by purchase_id;

6 rows affected.

[(103, 1), (102, 1), (104, 1), (101, 2), (105, 1), (None, 0)]

In [9]:
%%sql mysql://root:redhat@localhost:3306/mydb
select Name,Address ,count(productName) as purchase_number from cus 
left join pro on pro.pro_id =cus.purchase_id group by Name,Address;

8 rows affected.

[('Rajesh Sharma', 'Mumbai, India', 1),
 ('Sneha Kapoor', 'Delhi, India', 1),
 ('Amit Singh', 'Bangalore, India', 1),
 ('Priya Patel', 'Kolkata, India', 1),
 ('Neha Verma', 'Chennai, India', 1),
 (None, 'Hyderabad, India', 1),
 ('Pooja Reddy', 'Pune, India', 0),
 ('Arun Kumar', 'Jaipur, India', 0)]

In [10]:
%%sql mysql://root:redhat@localhost:3306/mydb
select productName,Price,Count(cus.purchase_id) as Purchases from pro
left join cus on pro.pro_id =cus.purchase_id group by productName,Price;

6 rows affected.

[('Laptop', 999, 2),
 ('Smartphone', 499, 1),
 ('Headphones', 79, 1),
 ('Tablet', 349, 1),
 ('Desktop Computer', 1199, 1),
 ('Wireless Mouse', 29, 0)]